---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementEmptySketch
source: html/c4bd45c4-d247-d1f8-b476-3140ccd193b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementEmptySketch Property

Sketch is empty. Can't create Path Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathReinforcementEmptySketch { get; }
```